#Когда Антон прочитал «Войну и мир», ему стало интересно, сколько слов и в каком количестве используется в этой книге.
#Помогите Антону написать упрощённую версию такой программы, которая сможет подсчитать слова, разделённые пробелом и вывести получившуюся статистику.
#Программа должна считывать одну строку со стандартного ввода и выводить для каждого уникального слова в этой строке число его повторений 
#(без учёта регистра) в формате "слово количество" (см. пример вывода).
#Порядок вывода слов может быть произвольным, каждое уникальное слово должно выводиться только один раз.

str_of_words = [x.lower() for x in input().split()]
words_amount = {}

for word in str_of_words:
    if word not in words_amount:
        words_amount[word] = 1
    else:
        words_amount[word] += 1
        
for key, value in words_amount.items():
    print(key, value, end='')
    print()
